> MyRule("john", 1.34, add, ls, 'adg', 45).
>
> value('1').
> value(1).
> value(1.0).
>
> value('1')?
Yes

> value(1)?
Yes

> value(1.000)?
Yes

>
> abc(A, B, C) :- div(A, B, C).
>
> abc(20, 3.0, X)?
X = 6.666666666667

>
